[MID_YouConquered]
[English]
You conquered

[MID_WinDugansDungeon]
[English]
I should have made it harder, I guess.  Good job, though.  Remember
back on the first level when you kept dying in that room with all the
roaches?  Ha ha!  Man, you were awful!  But now just look at you.
We're all so proud!  Oh, there I go crying again...

Having mastered this hold, you will now be allowed to reconstruct
Dugan's Dungeon in any way that suits you.  For this, push the "build"
brick from the main menu.  But do that later, because you're about to
witness a proper tribute to your sword-slinging prowess.  It's quite
long!  Remember that you can come back to it later by restoring the
room you just completed. Also, you can use the spacebar to pause and
the up/down arrows to adjust speed.

Enjoy Beethro's tale!

-Erik

[MID_WinHomemadeDungeon1]
[English]
And there's hardly any teethmarks on you!  Well done, fella.

If you enjoyed this hold, search for others devised by the one known as "

[MID_WinHomemadeDungeonCanEdit1]
[English]
".  This creator grants you a special favor: you may now carve and craft

[MID_WinHomemadeDungeonCanEdit2]
[English]
to match your own devious whims.  Push the "build" brick from the main menu, and you'll see what I mean.

[MID_WinIntro1]
[English]
Unka Beethro!  Unka Beethro!

[MID_WinIntro2]
[English]
What?  What?

[MID_WinIntro3]
[English]
Tell us about Dugan's Dungeon.

[MID_WinIntro4]
[English]
Ohhh, you don't want to hear about that.

[MID_WinIntro5]
[English]
We do!  We do!

[MID_WinIntro6]
[English]
It's a dark tale of violent death and horrible smells.

[MID_WinIntro7]
[English]
Tell us!

[MID_WinIntro8]
[English]
But you've already heard it.

[MID_WinIntro9]
[English]
We don't care!  We're bored.

[MID_WinIntro10]
[English]
Okay, but this is the last time.  It's a lot of work digging up my past memories.

[MID_WinIntro11]
[English]
Sure.  Tell us about the goblins.

[MID_WinIntro12]
[English]
I'm telling it from the very beginning, and I'll tell it just how I want.  If you get scared, you can cover your ears.

[MID_WinLevel1]
[English]
I began at the top level of Dugan's Dungeon.  The King's soldiers were too afraid to come down and help me.

That was fine.  They'd have just got in the way.

I quickly cleared the first level.

[MID_WinLevel2_1]
[English]
The second level was no big deal either.  There were roach queens, though, which can make for tedious work.

[MID_WinLevel2_2]
[English]
What are roach queens?

[MID_WinLevel2_3]
[English]
They're mommy roaches.  I had to kill them because they make baby roaches.

[MID_WinLevel2_4]
[English]
But you didn't kill the baby roaches, did you?

[MID_WinLevel2_5]
[English]
Well, yeah... I had to.

That's my job!

[MID_WinLevel2_6]
[English]
Mean!

[MID_WinLevel2_7]
[English]
They were bad baby roaches.  They had needle teeth and stinging drool!

[MID_WinLevel2_8]
[English]
Wahhhh!

[MID_WinLevel2_9]
[English]
Listen, some of you younger kids should go find something else to do.  I'm telling a serious story here!

[MID_WinLevel3_1]
[English]
On the third level, I found a nest of evil eyes.

[MID_WinLevel3_2]
[English]
Did you die?

[MID_WinLevel3_3]
[English]
No, I didn't die.

They were fairly easy to take care of, but I didn't expect them so close to the surface.

Usually, you find evil eyes starting at the fifth level.

[MID_WinLevel3_4]
[English]
How deep is Dugan's Dungeon?

[MID_WinLevel3_5]
[English]
Twenty-five levels deep.

[MID_WinLevel3_6]
[English]
Wow!  You conquered all twenty-five levels by yourself?

[MID_WinLevel3_7]
[English]
Yes.

[MID_WinLevel4_1]
[English]
Well, mostly.

There were mimics that helped me too.

[MID_WinLevel4_2]
[English]
I like mimics.  I wish I had a mimic.

[MID_WinLevel4_3]
[English]
When you're older, I'm sure you'll get one.

[MID_WinLevel4_4]
[English]
Hey, Unka Beethro!  Did you find the secret room on level four?

[MID_WinLevel4_5]
[English]
Of course!  It had some shortcuts to other levels.

[MID_WinLevel4_6]
[English]
I used them to skip over

[MID_WinLevel4_6Level]
level

[MID_WinLevel4_6Levels]
levels

[MID_And]
and

[MID_WinLevel4_7]
[English]
You said you conquered all twenty-five levels!

[MID_WinLevel4_8]
[English]
Well... um...

I meant that I will have conquered all twenty-five, levels after I go back and do a little routine cleanup.

[MID_WinLevel4_9]
[English]
Yeah, right.

[MID_WinLevel4_10]
[English]
What secret room on level four?

[MID_WinLevel4_11]
[English]
You didn't find it?  Ha ha!

[MID_WinLevel4_12]
[English]
How do you know about this secret room on level four?

[MID_WinLevel4_13]
[English]
Oh, come on!  Everyone knows about the secret room on level four.

[MID_WinLevel5_1]
[English]
Anyhow, on the seventh level...

[MID_WinLevel5_2]
[English]
What about the wraithwings on level five?

[MID_WinLevel5_3]
[English]
What about them?

[MID_WinLevel5_4]
[English]
You skipped them!

[MID_WinLevel5_5]
[English]
Okay, when I got to the fifth level, there were some wraithwings there.

[MID_WinLevel6_1]
[English]
Now on the seventh level...

[MID_WinLevel6_2]
[English]
What about the sixth level?

[MID_WinLevel6_3]
[English]
I already told you that I used the secret room shortcut to skip past it.

[MID_WinLevel6_4]
[English]
Oh, that's too bad.  I always wanted to hear about that level.

[MID_WinLevel6_5]
[English]
Well, how about level seven, where I did battle against vicious serpents?

[MID_WinLevel6_6]
[English]
I suppose.

[MID_WinLevel6_7]
[English]
I don't have anything to say about the sixth level, except that it was boring and repetitive.

Look, don't you want to hear about the serpents I fought against on level seven?

[MID_WinLevel6_8]
[English]
Yeah!

[MID_WinLevel7_1]
[English]
Okay, then.

Near the beginning of the level, I found a serpent circling inside a cage.

[MID_WinLevel7_2]
[English]
I got the serpent to chase after me.

Sometimes I had to wait for him to catch up.  Serpents are kind of dumb.

[MID_WinLevel7_3]
[English]
That room was pretty easy compared to others on the same level.  In one room, I found the longest serpent ever!

[MID_WinLevel7_4]
[English]
How long was it?

[MID_WinLevel7_5]
[English]
About one thousand, four hundred and forty-five feet long.  At least when I met him.

[MID_WinLevel7_6]
[English]
There is a clause in all my contracts that says I'm not obliged to deal with any monster longer than one thousand, four hundred and forty-four feet.

And I was feeling kind of lazy, so I just let that room be.

[MID_WinLevel7_7]
[English]
Boooring.

[MID_WinLevel7_8]
[English]
Lay off me kid!  I had other problems to contend with.

[MID_WinLevel7_9]
[English]
This room required a master intellect, and fortunately I am in possession of such a thing.

Although the serpent was fearsome to behold, the real trouble was getting to the roach queen.

[MID_WinLevel7_10]
[English]
She would have run me all around the room if I merely chased after her.  No time for that!

If I didn't get over to a certain location before the serpent died, it would be impossible to clear the room.

So I trapped queenie by waiting for her to get clogged up with her roach offspring.

[MID_WinLevel7_11]
[English]
With the queen out of the way, I had enough time to reach the critical location before the serpent shortened himself to death.

[MID_WinLevel8_1]
[English]
What happened next?

[MID_WinLevel8_2]
[English]
Tar!  And lots of it.

The eighth level was swamped with living tar.  I could hardly take a step without hacking through the stuff.

One room had three tar mothers in it.  It took me ages to clear it out.

[MID_WinLevel8_3]
[English]
That doesn't sound that hard.

[MID_WinLevel8_4]
[English]
Say that again, and see what happens to the back of your head.

[MID_WinLevel9_1]
[English]
What was on level nine?

[MID_WinLevel9_2]
[English]
A bunch of squirmy roaches.

[MID_WinLevel10_1]
[English]
What was on level ten?

[MID_WinLevel10_2]
[English]
Well, let me tell you...

[MID_WinLevel10_3]
[English]
Just give us the good stuff.  This is getting long.

[MID_WinLevel10_4]
[English]
Oh, but I'm just getting started!

[MID_WinLevel10_5]
[English]
Then there were the spiders...

Horrible, ghastly things!  You can only spot them when they blink, because they're the same color as the floor.

It's easy to start seeing things that aren't there...

Getting a little crazy...

And that's when they have you!  Ahhhhhhh!!!!

[MID_WinLevel10_6]
[English]
Aiyyyy!!!!

[MID_WinLevel10_7]
[English]
Ahhhhhhh!!!!

[MID_WinLevel11_1]
[English]
Then I found a level filled with tar!

[MID_WinLevel11_2]
[English]
You already told us about it.

[MID_WinLevel11_3]
[English]
No, this is a different tar level.  Tar was so deep here that it almost reached the ceiling.  I couldn't figure out where I was going because the tar was in the way.

That's just too much tar!

[MID_WinLevel11_4]
[English]
Yeah!

[MID_WinHalph1]
[English]
Hey, Unka Beethro!

Do you think I can be a dungeon exterminator like you some day?

[MID_WinHalph2]
[English]
No, I don't think you're smart enough.

[MID_WinHalph3]
[English]
Huh?

[MID_WinHalph4]
[English]
You'd get yourself digested on the first trip down.

[MID_WinHalph5]
[English]
You're trying to scare me!

[MID_WinHalph6]
[English]
Damn right!

You want a job?  Come see me in a few years and I'll set you up washing dishes over at the Grill.  Challenging work--you'll love it!

[MID_WinHalph7]
[English]
Okay.

[MID_WinLevel12_1]
[English]
On the twelfth level...

[MID_WinLevel12_2]
[English]
What?

[MID_WinLevel12_3]
[English]
I was just thinking about it for a moment.  Oh, those terrible serpents!  Sometimes I wake screaming in my bed.

Best not to say more about the twelfth level.

[MID_WinLevel12_4]
[English]
Did you find the secret room?

[MID_WinLevel12_5]
[English]
You've heard this story before, and you know I found the twelfth level secret room.

So why are you asking me about it?

[MID_WinLevel12_6]
[English]
I want to see if you say the same thing each time, so I can tell if you're lying.

[MID_WinLevel12_7]
[English]
I must say, of all my nephews, I like you least.

[MID_WinLevel12_8]
[English]
Uh... yes!  There was a big pile of candy there, and a magic flying mirror!

[MID_WinLevel12_9]
[English]
Why would a mirror fly?

[MID_WinLevel12_10]
[English]
Well, uh... if you were also flying, you could...

um...

use it.

[MID_WinLevel12_11]
[English]
You didn't find the secret room!

[MID_WinLevel12_12]
[English]
Hey, you can't prove I didn't!

[MID_WinLevel13_1]
[English]
Then came the labyrinth.  I uh...

skipped past it.

[MID_WinLevel13_2]
[English]
What was that?

[MID_WinLevel13_3]
[English]
I skipped past it!  I used a stairway from the secret room to go past it, okay?  There weren't any monsters on that level anyway.

Well, I'm pretty sure there weren't.

[MID_WinLevel13_4]
[English]
So Unka Beethro, what you're saying is: we should always find the easy way out.

[MID_WinLevel13_5]
[English]
No!

[MID_WinLevel13_6]
[English]
Avoid hard work whenever possible.

[MID_WinLevel13_7]
[English]
Not at all!

[MID_WinLevel13_8]
[English]
Yeah, whatever.

[MID_WinLevel13_9]
[English]
Then came the labyrinth!

Did I solve the labyrinth or did the labyrinth solve me?

[MID_WinLevel13_10]
[English]
That makes no sense.

[MID_WinLevel13_11]
[English]
It was a maze of twisty little passages, all alike!

I could have skipped past it, except for one measley roach off in the southwest corner.

My contract was to eradicate the entire dungeon population, so I had to track that bug down.

[MID_WinLevel14_1]
[English]
Tell us about the goblins!

[MID_WinLevel14_2]
[English]
I was going to, but then you started getting pushy.

[MID_WinLevel14_3]
[English]
At school they say goblins are peaceful.

[MID_WinLevel14_4]
[English]
Ha!  Peaceful when they're dead!

[MID_WinLevel15_1]
[English]
No, we won't talk about goblins just yet.

[MID_WinLevel15_2]
[English]
Let's talk about trapdoors.  Now those things are dangerous!

[MID_WinLevel15_3]
[English]
You can't get hurt by a dungeon trapdoor.  They only fall after you step off.

[MID_WinLevel15_4]
[English]
Yeah, sure.  But what if you were in a room filled with trapdoors?

And you couldn't get out until you dropped them all?

And you had to hit a bunch of orbs along the way?

Then what would you do, smart guy?  Huh?

[MID_WinLevel15_5]
[English]
Uh...

[MID_WinLevel15_6]
[English]
You'd get stuck and die of starvation!  So don't act like a big trapdoor expert.  I can throw you down there and see how you do!

[MID_WinLevel16_1]
[English]
I faced tricky combinations of tar and monsters on the sixteenth level.  Strategic thinking got me through.

For instance, one room had three different entrances to choose from--north, south, and west.  It was quartered into four chambers, with a tar mother in the southeast corner, and a roach queen in the other three.

So which entrance did I pick?  Well...

[MID_WinLevel16_2]
[English]
You went in from the

[MID_WinLevel16_3]
[English]
Oh, you've heard this story before.  Can I tell it without your help?

[MID_WinLevel16_4]
[English]
Well, you did ask.

[MID_WinLevel16_5]
[English]
Your ordinary exterminator would probably have chosen the south or west entrance.  "Closer to the tar mother," he'd be thinking.

But me, I took it from the north.  That approach gave me the quickest kill on a roach queen.

[MID_WinLevel16_6]
[English]
At a glance, I knew the south entrance would work best.  Easiest for getting to the tar mother in a hurry.

[MID_WinLevel16_7]
[English]
Intuition told me to go in from the west.  The advantages of an eastward flow could not be denied.

[MID_WinLevel16_8]
[English]
It probably didn't matter which way you came in.

[MID_WinLevel16_9]
[English]
Were you there?

[MID_WinLevel16_10]
[English]
No.

[MID_WinLevel16_11]
[English]
Then shut up!

After carefully choosing my entrance, I was met with another strategic question.

Which of the four chambers would I attack first?

[MID_WinLevel16_12]
[English]
The--

[MID_WinLevel16_13]
[English]
Quiet!

[MID_WinLevel16_14]
[English]
It was obvious that the

[MID_WinLevel16_15]
[English]
chamber must be cleared before the others.  So I sprung forward with great vigor and...

[MID_WinLevel16_16]
[English]
Wait a minute!  I didn't go into that chamber first.  Which one was it?

[MID_WinLevel16_17]
[English]
The

[MID_WinLevel16_18]
[English]
chamber.

[MID_WinLevel16_19]
[English]
Hey!  I thought I told you to close that smart mouth of yours.

[MID_WinLevel16_20]
[English]
So first, I sprung into the uh...

[MID_WinLevel16_21]
[English]
chamber with great vigor.  I cleared it out easily enough.

[MID_WinLevel16_22]
[English]
Then I gave the

[MID_WinLevel16_23]
[English]
chamber a heavy smitedown!

Yeah, now I remember--

[MID_WinLevel16_24]
[English]
had to come second.  It was crucial to my strategy!

[MID_WinLevel16_25]
[English]
And you can't even imagine the carnage I brought to the

[MID_WinLevel16_26]
[English]
chamber!

[MID_WinLevel16_27]
[English]
third roach queen

[MID_WinLevel16_28]
[English]
tar mother

[MID_WinLevel16_29]
[English]
Finally, I headed

[MID_WinLevel16_30]
[English]
to pay my last respects to the

[MID_WinLevel16_31]
[English]
And there is a conquest for the textbooks-- a fine example of perfect planning!

[MID_WinLevel17_1]
[English]
Now other levels, like the seventeenth, are all about efficiency.  In other words, doing things without wasting time and energy.

[MID_WinLevel17_2]
[English]
You should tell this story with efficiency.

[MID_WinLevel17_3]
[English]
But what fun would that be?

[MID_WinLevel18_1]
[English]
I met plenty of goblins on the next level.

[MID_WinLevel18_2]
[English]
Yeah!  Goblins are the best!

[MID_WinLevel18_3]
[English]
Why are you guys so huge on goblins?

[MID_WinLevel18_4]
[English]
Goblins are smart.  Sometimes they help you, too.

[MID_WinLevel18_5]
[English]
Well, no goblin ever did me any favors.

Actually, that's not quite true...

[MID_WinLevel18_6]
[English]
I suppose when you make a "point" to ask them, they're usually willing to help out.

[MID_WinLevel19_1]
[English]
Wraithwings are, in some ways, smarter than goblins.

Depending on the situation, it can be much harder to get them to do what you want.

[MID_WinLevel20_1]
[English]
For a long time, I've suspected an outside influence operating inside dungeons, making them much more dangerous than they should naturally be.

I mean, a dungeon is for stowing your prisoners, treasure, and magic mushrooms.  Why make it more complicated than that?

I wasn't convinced until the last trip down to Dugan's Dungeon.  On the twentieth level, I found something I'd never before seen...

[MID_WinLevel20_2]
[English]
Monsters suddenly got smarter and I couldn't figure out why.  It was terrible!

I discovered that a brain monster was controlling them.  This brain was smart.

[MID_WinLevel20_3]
[English]
Smarter than you?

[MID_WinLevel20_4]
[English]
Of course not!  I'm pretty smart, after all.

At first, the brains seemed perfect, but they had flaws.  For instance, they'd send serpents into passages blocked by other monsters.

[MID_WinLevel21_1]
[English]
My problems with the brains only got worse.  The next level was an onslaught organized against me.

Monsters aren't supposed to take orders from anybody.  So what does it mean when they suddenly have a leader?

[MID_WinLevel22_1]
[English]
Want to hear about how I commanded eight mimics at once?

[MID_WinLevel22_2]
[English]
No, we want to hear more about goblins.

[MID_WinLevel22_3]
[English]
Sigh.

[MID_WinLevel23_1]
[English]
Well, what do you want to know about goblins?

[MID_WinLevel23_2]
[English]
Could you beat three goblins?

[MID_WinLevel23_3]
[English]
Sure I could.

[MID_WinLevel23_4]
[English]
And could you beat two goblins?

[MID_WinLevel23_5]
[English]
Uh huh.

[MID_WinLevel23_6]
[English]
Wow, you are good!

[MID_WinLevel24_1]
[English]
There was a monster city way down at the bottom of the dungeon.  It was called "Neatherville".

[MID_WinLevel24_2]
[English]
Fun!

[MID_WinLevel24_3]
[English]
Not really.

The critters living there really didn't appreciate my visit.

[MID_WinLevel25_1]
[English]
Now, when I got down to the last level, I spotted this odd little man.  I wanted to talk to him, but he ran off.

[MID_WinLevel25_2]
[English]
I followed him, of course.

[MID_WinLevel25_3]
[English]
But he always kept ahead...

[MID_WinLevel25_4]
[English]
...and tried to kill me several times.

[MID_WinLevel25_5]
[English]
The tiny fellow was downright murderous!

[MID_WinLevel25_6]
[English]
Fortunately, I was careful not to fall into his traps.

[MID_WinLevel25_7]
[English]
I chased him through many rooms...

[MID_WinLevel25_8]
[English]
...and killed all the monsters along the way.  I didn't forget my job!

[MID_WinLevel25_9]
[English]
He had a strange immunity to monsters-- it was like he was one of them, so they ignored him.

[MID_WinLevel25_10]
[English]
He knew those rooms so well.  It looked hopeless for me!

[MID_WinLevel25_11]
[English]
But finally I got the upper hand and forced him from his escape path.

[MID_WinLevel25_12]
[English]
I realized this was the lost son of King Dugan the Second-- the legendary 'Neather, who chose to live in the dungeon and master all its secrets!

[MID_WinLevel25_13]
[English]
I wanted to bring the 'Neather back with me, but it all ended so horribly.

I was put in a situation where I could only choose between his death or mine.

It's too bad.  There were so many questions I wanted to ask him.

[MID_WinLevel25_14]
[English]
But before he died, he whispered something to me...

[MID_WinNeatherSpeech]
[English]
He said, "Speak to the children and tell them this:



That they should listen to their elders with respect.

And consider the intent of their words carefully.

And wander not into dangerous places.

And treat all creatures well, whether they be fair or ugly.  Those that dwell beneath merely follow their given nature.

And eat what food you are gifted without complaint.

And end not your sentences with prepositions, for it tells of ignorance.

And seek not to twiddle your thumbs in two different directions at once.

And fear not to gargle loudly, but only when it will bring gain.

And...

[MID_WinEnd1]
[English]
The quality of his advice got a lot worse.  I just kinda left him there talking.

After killing the last monster in the dungeon, I went down the stairs.

[MID_WinEnd2]
[English]
How could there be stairs?

[MID_WinEnd3]
[English]
What do you mean?

[MID_WinEnd4]
[English]
You said there were just twenty-five levels.

But if you went down the stairs, then there must have been a twenty-sixth level.

[MID_WinEnd5]
[English]
Well, it wasn't really another level...

[MID_WinEnd6]
[English]
It was just a dead-end.

I was hoping somebody would have built an elevator there, but no such luck.  You can't imagine how tiresome the walk back up was.  Oh, my poor feet!

[MID_WinEnd7]
[English]
So that was the end of the dungeon, right?

[MID_WinEnd8]
[English]
Yes, but...

[MID_WinEnd9]
[English]
What?

[MID_WinEnd10]
[English]
There was one other thing...

[MID_WinEnd11]
[English]
What?

[MID_WinEnd12]
[English]
I probably shouldn't tell you about that.

[MID_WinEnd13]
[English]
Okay, then forget it.

[MID_WinEnd14]
[English]
Hey!  You're not supposed to give up that easy.

[MID_WinTheDoor1]
[English]
Back on level ten, with the spiders, I discovered a very strange door.

I never found a way to reach the other side of it, but someone could come through the other way.

That door drove me nuts!  I'm going back with proper tools.  I will learn what is behind it!

[MID_WinTheDoor2]
[English]
How come it bugs you so much?

[MID_WinTheDoor3]
[English]
Well fella, there is a long-standing question about how dungeons become so deep and dangerous.

Why so many tricks and traps?

And how do the beasties move in so quick?

[MID_WinTheDoor4]
[English]
Don't ask a dungeon architect.  They keep to themselves and won't speak of their work.

"Trade secrets", they say.

[MID_WinTheDoor5]
[English]
Dugan's grandpop, first King of Dugandy, paid for a nine-level dungeon.  I know it's true, because I've seen the original work order.

Some architect built the thing, and by all accounts, it was a strictly no-frills construction.

Decades later, old Gunthro Budkin exterminated the place.  After resurfacing, he announced the dungeon contained not nine levels, but...

[MID_WinTheDoor6]
[English]
Fifteen levels!

Of course, the poor guy only got paid for clearing nine.

[MID_WinTheDoor7]
[English]
Didn't you say there were twenty-five levels?

[MID_WinTheDoor8]
[English]
Somebody was listening after all!

Yeah, now we think there are twenty-five levels.  But next time somebody goes down there, I bet he finds more.

Dungeons always seem to grow, and who knows how?

[MID_WinTheDoor9]
[English]
I do!

[MID_WinTheDoor10]
[English]
No, you don't!

There's been plenty of talk from the crackpot section of the Smitemaster's Guild about passageways that connect Dugan's and several other dungeons to one big secret headquarters.

They call this place "Rooted Hold".

Supposedly, someone is expanding the dungeons from there.  Depending who you like to worry about, it's the Dungeon Architects Association, the Band of the Kingless, the Gadhan family, or even the Smitemaster's Guild.

[MID_WinTheDoor11]
[English]
So there's a tunnel to Rooted Hold behind that door you found?

[MID_WinTheDoor12]
[English]
No, it's probably just a dumb joke the architect put in to get me angry.

But as a Smitemaster, I have to uncover a little truth to share with my neathgoing brothers.  Especially now, when the Guild is wasting so much time listening to stupid theories from any fool that can stand up and spit words out his mouth.

We need real answers to put these questions behind us.  Then we smitemasters can get back to business!

[MID_WinTheDoor13]
[English]
Now when I first joined the Smitemaster's Guild...

Hey!   Where are you going?

[MID_WinTheDoor14]
[English]
You're off on that Guild stuff again.  It's boring.

[MID_WinTheDoor15]
[English]
Oh...  Is it really that dull?

[MID_WinTheDoor16]
[English]
Yeah, we're going to find something else to do.  Maybe help out with the dishes or go to bed early.

[MID_WinTheDoor17]
[English]
Wow, I guess it was pretty boring.

I'll see you knucklebumps later.  Remember to keep out of caves, holes, basements, and generally any place below ground level!

[MID_WinTheDoor18]
[English]
We know, Unka Beethro.

[MID_WinError1]
[English]
You know, Unka Beethro's feeling pretty tired right now.  I think we should continue this story some other time.

[MID_WinError2]
[English]
But you said...

[MID_WinError3]
[English]
Ask me again tomorrow.

[MID_WinError4]
[English]
That's cheap!

[MID_WinError5]
[English]
Okay.  Do you little snotheads want to know the real reason I won't finish the story?

[MID_WinError6]
[English]
Yeah, why won't you finish the story?

[MID_WinError7]
[English]
Because I've forgotten some of the important parts.  There are certain rooms I'm sure I visited, and I wanted to tell you about them, but I can't seem to remember the details.

[MID_WinError8]
[English]
Unka Beethro is going senile.

[MID_WinError9]
[English]
You little punk!

[MID_WinFailedToRetrieveDemo]
[English]
Seriously, the DROD application failed to retrieve a recorded demo of your gameplay in a certain room.  I wanted to use that demo to generate the dialogue for Beethro's story.  The problem could have been caused by an error in the application.  If so, I apologize, and please, let me know about it by sending an e-mail to bugs@drod.net.

Another reason may be that you are using a version of DROD that allows you to skip past rooms without completing them, and you haven't played all the rooms.  If this is the case, I encourage you to go back and conquer the rooms you missed, so that you can get the full experience of Dugan's Dungeon, including the complete story as told by Beethro.

I hope you have enjoyed the game.  I'll be transferring you to the credits screen in a moment.

-Erik
